/* ***************************************************************************
 * @file		VSTDCond.hpp
 * @brief		条件変数シグナル送受信用 Class
 * @see		POSIX Thread <pthread.h>
 * @author		Sebastian
 * @date		2009/7/16
 * @version	1.0
 *  
 *
 * @par 更新履歴：
 * - 2009/07/16	Sebastian 新規作成
 * ***************************************************************************/
#ifndef VSTDCOND_HPP_
#define VSTDCOND_HPP_
/* ***************************************************************************
 * including library
 * ***************************************************************************/ 
#include <pthread.h>
namespace VSTD
{
	/* ***************************************************************************
	 * @brief		Condition
	 * 				条件変数シグナル送受信用 Class
	 * @see		POSIX Thread <pthread.h>
	 * @author		Sebastian
	 * @date		2009/7/16
	 * ***************************************************************************/
	class Condition
	{
	private:
		/* ***********************************************************************
		 * プライベートメンバ変数
		 * ***********************************************************************/
		/** @brief シグナル受け取り用条件変数 */
		pthread_cond_t		signal;
		/** @brief ミューテックス取得用ID */
		pthread_mutex_t		mutex_lock;
		/** @brief ミューテックス属性　*/
		pthread_mutexattr_t	mutex_attr;
	public:
		/* ***********************************************************************
		 * コンストラクタ/デストラクタ
		 * ***********************************************************************/
		Condition(void);
		~Condition(void);
		/* ***********************************************************************
		 * パブリックメソッド
		 * ***********************************************************************/
		bool	created;
		void	set();
		bool	wait();
		void	reset();
	};
}
#endif

